In [1]:
import pandas as pd
import numpy as np
import os

In [ ]:
exam_data = {'name':['stu1','stu2','stu3','stu4','stu5'],
             'math':[78, 85, 96, 80, 86],
             'eng':[85, 80, 89, 90, 90],
             'music':[92, 88, 84, 89, 86],
             'science':[70, 75, 78, 75, 80]}
df = pd.DataFrame(exam_data)
df

In [ ]:
df.transpose()

In [ ]:
df = df.T
df

In [ ]:
ndf = df.set_index(['name'])
print(ndf)
print('\n')
ndf2 = df.set_index(['music'])
print(ndf2)
print('\n')
ndf3 = df.set_index(['math','science'])
print(ndf3)

In [ ]:
dict_data = {'c0':[1, 2, 3],
             'c1':[4, 5, 6], 
             'c2':[7, 8, 9],
             'c3':[10, 11, 12],
             'c4':[13, 14, 15]}
df = pd.DataFrame(dict_data)
print(df)

df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

In [ ]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

In [ ]:
#fill NaN
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index, fill_value=0)
print(ndf)

In [ ]:
dict_data = {'c0':[1, 2, 3],
             'c1':[4, 5, 6], 
             'c2':[7, 8, 9],
             'c3':[10, 11, 12],
             'c4':[13, 14, 15]}
#assigning new index
df = pd.DataFrame(dict_data)
print(df)

In [ ]:
#reset index
df_reset = df.reset_index()
print(df_reset)

In [ ]:
ndf = df.sort_index(ascending=False)
print(ndf)

In [ ]:
ndf = df.sort_values(by='c1',ascending=True)
print(ndf)

In [2]:
stu1 = {'name':'stu1', 'math':78, 'eng':85, 'music':92, 'science':70}
stu2 = {'name':'stu2', 'math':85, 'eng':80, 'music':88, 'science':75}
stu3 = {'name':'stu3', 'math':96, 'eng':89, 'music':84, 'science':78}
stu4 = {'name':'stu4', 'math':80, 'eng':90, 'music':89, 'science':75}
stu5 = {'name':'stu5', 'math':86, 'eng':90, 'music':86, 'science':80}
student1 = pd.Series(stu1)
student2 = pd.Series(stu2)

NameError: name 'pd' is not defined

In [ ]:
#divide the score
percentage =  student1 / 200;

In [ ]:
addition = student1 + student2
addition

In [ ]:
result = pd.DataFrame({'student1': student1, 'student2': student2})

In [ ]:
stu1 = {'name':'stu1', 'math':78, 'eng':np.nan, 'music':92, 'science':70}
stu2 = {'name':'stu2', 'math':85, 'eng':80, 'music':88, 'science':75}
student1 = pd.Series(stu1)
student2 = pd.Series(stu2)
print(student1)
print(student2)

In [7]:
stu1 = {'name':'stu1', 'math':78, 'eng':np.nan, 'music':92, 'science':70}
stu2 = {'name':'stu2', 'math':85, 'eng':80, 'music':88, 'science':75}
student1 = pd.Series(stu1)
student2 = pd.Series(stu2)
sr_add = student1.add(student2, fill_value=0)
print(sr_add)

name       stu1stu2
math            163
eng              80
music           180
science         145
dtype: object

Seaborn is a Python data visualization library based on matplotlib. It provides a high-level interface for drawing attractive and informative statistical graphics.

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [3]:
print(titanic.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [4]:
print(titanic.info)

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
titanic.info

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [7]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [8]:
print(titanic.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [9]:
df = titanic.loc[:,['age','fare']]
print('\n First 5 rows')
print(df.head())
print('\n Last 5 rows')
print(df.tail())
print(type(df))

 First 5 rows
    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

 Last 5 rows
      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75
<class 'pandas.core.frame.DataFrame'>

In [ ]:
import matplotlib.pyplot as plt

# Create visualizations using seaborn with the titanic dataset
fig, axes = plt.subplots(2, 2, figsize=(12, 10))

# Plot 1: Distribution of age
sns.histplot(data=titanic, x='age', bins=30, kde=True, ax=axes[0, 0])
axes[0, 0].set_title('Age Distribution')

# Plot 2: Survival count
sns.countplot(data=titanic, x='survived', ax=axes[0, 1])
axes[0, 1].set_title('Survival Count')

# Plot 3: Survival by class
sns.countplot(data=titanic, x='pclass', hue='survived', ax=axes[1, 0])
axes[1, 0].set_title('Survival by Passenger Class')

# Plot 4: Fare distribution by class
sns.boxplot(data=titanic, x='pclass', y='fare', ax=axes[1, 1])
axes[1, 1].set_title('Fare Distribution by Class')

plt.tight_layout()
plt.show()

In [18]:
os.chdir(r'D:\SEM VI\NCDL')

In [17]:
df = pd.read_csv('data_iris.csv')
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB
None

In [20]:
print(df.describe())

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [21]:
print(df.shape)

(150, 5)

In [22]:
print(df.head())

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [23]:
print(df.tail())

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [25]:
df.select_dtypes(include=[np.number]).mean(axis=0)

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [27]:
df.mean(axis=0,numeric_only=True)

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [30]:
df.loc[:,'Sepal.Length'].corr(df.loc[:,'Petal.Length'])

np.float64(0.8717537758865831)

In [32]:
df.loc[:,'Sepal.Length'].corr(df.loc[:,'Sepal.Width'])

np.float64(-0.11756978413300198)

In [34]:
np.round(df.corr(),2)

ValueError: could not convert string to float: 'setosa'

In [35]:
df.shape

(150, 5)

In [37]:
df.iloc[10,0] = np.nan
df.iloc[2,2] = np.nan
df.iloc[17,2] = np.nan
df.iloc[129,2] = np.nan

In [38]:
df.drop(columns=['Species']).mean(axis=0)

Sepal.Length    5.846309
Sepal.Width     3.057333
Petal.Length    3.776871
Petal.Width     1.199333
dtype: float64

In [39]:
df.drop(columns=['Species']).mean(axis=0,skipna=False)

Sepal.Length         NaN
Sepal.Width     3.057333
Petal.Length         NaN
Petal.Width     1.199333
dtype: float64

In [41]:
df.drop(columns=['Species']).mean(axis=0,skipna=True)

Sepal.Length    5.846309
Sepal.Width     3.057333
Petal.Length    3.776871
Petal.Width     1.199333
dtype: float64

In [43]:
df.shape

(150, 5)

In [44]:
df2 = df.dropna(axis=0,thresh=4)
df2.shape

(150, 5)

In [45]:
df3 = df.dropna(axis=1)
df3.shape

(150, 3)

In [46]:
df3.head()

   Sepal.Width  Petal.Width Species
0          3.5          0.2  setosa
1          3.0          0.2  setosa
2          3.2          0.2  setosa
3          3.1          0.2  setosa
4          3.6          0.2  setosa

In [47]:
df4 = df.fillna(value=0)
df4.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           0.0          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [55]:
df['Sepal.Length'] = df['Sepal.Length'].fillna(value=df['Sepal.Length'].mean())
df['Petal.Length'] = df['Petal.Length'].fillna(value=df['Petal.Length'].mean())
df['Sepal.Width'] = df['Sepal.Width'].fillna(value=df['Sepal.Width'].mean())

In [ ]:
import